# RebarBarStyle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarBarStyle Property
ParameterTypeId Class See Also
---
"Subcategory"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarBarStyle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarBarStyle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarBarStyle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace